Repository: passionweb-manuel-schnabel/ai-seo-helper
Catalog: Resources/Private/Language/*.backend.xlf
Languages: de

# AiSeoHelper.generation.keywords
source: Generate keywords
de: Keywords generieren

# AiSeoHelper.generation.newsKeywords
source: Generate keywords for news article
de: Keywords für News-Artikel generieren

# AiSeoHelper.generation.metaDescriptionSuggestions
source: Generate meta description suggestions
de: Meta-Beschreibungs-Vorschläge generieren

# AiSeoHelper.generation.pageTitleSuggestions
source: Generate page title suggestions
de: Page-Titel Vorschläge generieren

# AiSeoHelper.generation.ogTitleSuggestions
source: Generate Open Graph title suggestions
de: Open Graph Titel Vorschläge generieren

# AiSeoHelper.generation.twitterTitleSuggestions
source: Generate Twitter title suggestions
de: Twitter-Titel Vorschläge generieren

# AiSeoHelper.generation.newsAlternativeTitleSuggestions
source: Generate alternative title suggestions for news article
de: Titel-Vorschläge für News-Artikel generieren

# AiSeoHelper.generation.ogDescriptionSuggestions
source: Generate Open Graph description suggestions
de: Open Graph BeschreibungsVorschläge generieren

# AiSeoHelper.generation.twitterDescriptionSuggestions
source: Generate Twitter description suggestions
de: Twitter-Beschreibungs Vorschläge generieren

# AiSeoHelper.generation.newsDescriptionSuggestions
source: Generate description suggestions for news article
de: Beschreibungs-Vorschläge für News-Artikel generieren

# AiSeoHelper.notification.generation.start
source: Started
de: Start

# AiSeoHelper.notification.generation.finish
source: Finished
de: Fertig

# AiSeoHelper.notification.generation.copy
source: Copied
de: Kopiert

# AiSeoHelper.notification.generation.error
source: Unexpected error
de: Unerwarteter Fehler

# AiSeoHelper.notification.generation.requestError
source: Request error
de: Request-Fehler

# AiSeoHelper.notification.generation.start.keywords
source: Keywords generation is in progress. Please wait...
de: Keyword-Generierung läuft. Bitte warten...

# AiSeoHelper.notification.generation.finish.keywords
source: Keywords were generated successfully.
de: Keywords wurden erfolgreich generiert.

# AiSeoHelper.notification.generation.start.metaDescription
source: Meta description generation is in progress. Please wait...
de: Generierung der Meta-Beschreibung läuft. Bitte warten...

# AiSeoHelper.notification.generation.finish.metaDescription
source: Meta description was generated successfully.
de: Meta-Beschreibung wurde erfolgreich generiert.

# AiSeoHelper.notification.generation.start.suggestions
source: Suggestions generation is in progress. Please wait...
de: Vorschläge werden generiert. Bitte warten...

# AiSeoHelper.notification.generation.finish.suggestions
source: Suggestions were generated successfully.
de: Vorschläge wurden erfolgreich generiert.

# AiSeoHelper.notification.generation.suggestions.missingSelection
source: Missing selection
de: Fehlende Auswahl

# AiSeoHelper.notification.generation.suggestions.missingSelectionInfo
source: Please select a suggestion.
de: Bitte wählen Sie einen Vorschlag aus.

# AiSeoHelper.notification.generation.suggestions.ogTwitterTitlesUpdated
source: Copied selected suggestion to fields for Open Graph and Twitter title.
de: Gewählten Vorschlag in die Felder für Open Graph und Twitter Titel kopiert.

# AiSeoHelper.notification.generation.suggestions.ogTwitterDescriptionsUpdated
source: Copied selected suggestion to fields for Open Graph and Twitter description.
de: Gewählten Vorschlag in die Felder für Open Graph und Twitter Beschreibung kopiert.

# AiSeoHelper.unableToLinkToPage
source: Unable to link to page with ID %s and language ID %s
de: Es konnte kein Vorschaulink für die Seite mit der ID %s und der Sprach-ID %s erstellt werden

# AiSeoHelper.suggestionsHeader
source: Generated suggestions
de: Generierte Vorschläge

# AiSeoHelper.suggestionsSubheader
source: Please select your favorite suggestion:
de: Bitte wählen Sie Ihren bevorzugten Vorschlag aus:

# AiSeoHelper.setSuggestion
source: Set selected suggestion
de: Ausgewählten Vorschlag setzen

# AiSeoHelper.removeSuggestions
source: Remove suggestions
de: Vorschläge entfernen

# AiSeoHelper.fetchContentFailed
source: Page content could not be loaded.
de: Inhalt der Seite konnte nicht geladen werden

# AiSeoHelper.apiNotReachable
source: Unfortunately, the OpenAI API is currently not available. Please try again later.
de: OpenAI-Schnittstelle ist aktuell leider nicht erreichbar. Bitte versuche es später erneut.

# AiSeoHelper.missingApiKey
source: OpenAI verification failed. Maybe you haven't saved your API key in the extension configuration yet?
de: OpenAI-Verifizierung schlug fehl. Eventuell hast du deinen API-Schlüssel noch nicht in der Extension-Konfiguration hinterlegt?

# AiSeoHelper.pageNotAccessible
source: Page not found. If the page is hidden, please activate it (and possibly deactivate the option "Page in menus activated" within the page properties) so that the page is accessible.
de: Seite konnte nicht gefunden werden. Falls die Seite versteckt ist, bitte aktiviere diese (und deaktiviere ggf. die Option "Seite in Menüs aktiviert" innerhalb der Seiteneigenschaften), sodass die Seite erreichbar ist.

# AiSeoHelper.noValidAiResponse
source: Could not fetch valid response from AI. Please try again.
de: Keine valide KI-Antwort erhalten. Bitte versuche es erneut.

# AiSeoHelper.tx_aiseohelper_domain_model_customlanguage
source: Custom language
de: Benutzerdefinierte Sprache

# AiSeoHelper.tx_aiseohelper_domain_model_customlanguage.speech
source: Speech
de: Sprache
